src/cf/InformationRegisters/НапоминанияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиВремениНапоминания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиВремениНапоминания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалВремениНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Comment>Представление источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/CRM_УстановкаИспользуемыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_УстановкаИспользуемыхПоказателей</Name>
			<Comment>Соглашение об используемых показателях планирования</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CRM_ИспользуемыеКлючевыеПоказатели</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателяМаксимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериодаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериодаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ШаблоныКлючевыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыУстановкиИспользуемыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодаПланирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользуемыеПоказатели</Name>
					<Comment>Используемые показатели планирования</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Comment>Показатель планирования</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ШаблоныКлючевыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Согласовано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБонуса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесПоказателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоказателяМаксимум</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Менеджеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Менеджер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/CRM_ДемонстрационныйРежим/Ext/Module.bsl
//////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ В ДЕМОНСТРАЦИОННОМ РЕЖИМЕ

// Процедура проверяет и обновляет демонстрационные данные в демо-режиме
Функция ЭтоДемоРежим() Экспорт
	Возврат Константы.CRM_ДемонстрационныйРежим.Получить();
КонецФункции

Процедура ПроверкаОбновлениеДемоДанные() Экспорт
	Если Константы.CRM_ДемонстрационныйРежим.Получить() Тогда
		УстановитьПривилегированныйРежим(Истина);
		
		Если Не CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
			
			Константы.CRM_ДемонстрационныйРежим.Установить(Ложь);
			
			Возврат;			
		
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВложенныйЗапрос.Дата КАК Дата,
		|	ВложенныйЗапрос.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		CRM_Взаимодействие.Дата КАК Дата,
		|		CRM_Взаимодействие.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_ДокументРасчетовСКонтрагентом.Дата,
		|		CRM_ДокументРасчетовСКонтрагентом.Ссылка
		|	ИЗ
		|		Документ.CRM_ДокументРасчетовСКонтрагентом КАК CRM_ДокументРасчетовСКонтрагентом
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_Интерес.Дата,
		|		CRM_Интерес.Ссылка
		|	ИЗ
		|		Документ.CRM_Интерес КАК CRM_Интерес
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_ОтчетОРаботе.Дата,
		|		CRM_ОтчетОРаботе.Ссылка
		|	ИЗ
		|		Документ.CRM_ОтчетОРаботе КАК CRM_ОтчетОРаботе
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	
		|	ВЫБРАТЬ
		|		CRM_ПланированиеВоронкиПродаж.Дата,
		|		CRM_ПланированиеВоронкиПродаж.Ссылка
		|	ИЗ
		|		Документ.CRM_ПланированиеВоронкиПродаж КАК CRM_ПланированиеВоронкиПродаж
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_РассылкаЭлектронныхПисем.Дата,
		|		CRM_РассылкаЭлектронныхПисем.Ссылка
		|	ИЗ
		|		Документ.CRM_РассылкаЭлектронныхПисем КАК CRM_РассылкаЭлектронныхПисем
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		удалитьCRM_Сделка.Дата,
		|		удалитьCRM_Сделка.Ссылка
		|	ИЗ
		|		Документ.удалитьCRM_Сделка КАК удалитьCRM_Сделка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		УдалитьCRM_Событие.Дата,
		|		УдалитьCRM_Событие.Ссылка
		|	ИЗ
		|		Документ.УдалитьCRM_Событие КАК УдалитьCRM_Событие
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_УстановкаИспользуемыхПоказателей.Дата,
		|		CRM_УстановкаИспользуемыхПоказателей.Ссылка
		|	ИЗ
		|		Документ.CRM_УстановкаИспользуемыхПоказателей КАК CRM_УстановкаИспользуемыхПоказателей
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_Телемаркетинг.Дата,
		|		CRM_Телемаркетинг.Ссылка
		|	ИЗ
		|		Документ.CRM_Телемаркетинг КАК CRM_Телемаркетинг
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Анкета.Дата,
		|		Анкета.Ссылка
		|	ИЗ
		|		Документ.Анкета КАК Анкета
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КоммерческоеПредложениеКлиенту.Дата,
		|		КоммерческоеПредложениеКлиенту.Ссылка
		|	ИЗ
		|		Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КорректировкаРегистров.Дата,
		|		КорректировкаРегистров.Ссылка
		|	ИЗ
		|		Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НазначениеОпросов.Дата,
		|		НазначениеОпросов.Ссылка
		|	ИЗ
		|		Документ.НазначениеОпросов КАК НазначениеОпросов
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СообщениеSMS.Дата,
		|		СообщениеSMS.Ссылка
		|	ИЗ
		|		Документ.СообщениеSMS КАК СообщениеSMS
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТелефонныйЗвонок.Дата,
		|		ТелефонныйЗвонок.Ссылка
		|	ИЗ
		|		Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЭлектронноеПисьмоВходящее.Дата,
		|		ЭлектронноеПисьмоВходящее.Ссылка
		|	ИЗ
		|		Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЭлектронноеПисьмоИсходящее.Дата,
		|		ЭлектронноеПисьмоИсходящее.Ссылка
		|	ИЗ
		|		Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗадачаИсполнителя.Дата,
		|		ЗадачаИсполнителя.Ссылка
		|	ИЗ
		|		Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя) КАК ВложенныйЗапрос
		|	
		// +CRM не переносить в объединенные решения
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_СчетНаОплатуПокупателю.Дата,
		|		CRM_СчетНаОплатуПокупателю.Ссылка
		|	ИЗ
		|		Документ.CRM_СчетНаОплатуПокупателю КАК CRM_СчетНаОплатуПокупателю
		// -CRM не переносить в объединенные решения
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДатаПоследнегоОбъекта = Выборка.Дата;
		Иначе
			Возврат;
		КонецЕсли;
		//Возврат;
		ПараметрыДаты = Новый КвалификаторыДаты();
		Массив = Новый Массив;
		Массив.Добавить(Тип("Дата"));
		
		ОписаниеДата = Новый ОписаниеТипов(Массив,,,,,ПараметрыДаты);
		
		ПараметрыДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
		Массив = Новый Массив;
		Массив.Добавить(Тип("Дата"));
		
		ОписаниеДатаВремя = Новый ОписаниеТипов(Массив,,,,,ПараметрыДаты);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ    РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Ссылка КАК Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		CRM_Взаимодействие.Ссылка КАК Ссылка
		|	ИЗ
		|		Документ.CRM_Взаимодействие КАК CRM_Взаимодействие
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_ДокументРасчетовСКонтрагентом.Ссылка
		|	ИЗ
		|		Документ.CRM_ДокументРасчетовСКонтрагентом КАК CRM_ДокументРасчетовСКонтрагентом
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_Интерес.Ссылка
		|	ИЗ
		|		Документ.CRM_Интерес КАК CRM_Интерес
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_КонтрольнаяТочкаПроекта.Ссылка
		|	ИЗ
		|		Документ.CRM_КонтрольнаяТочкаПроекта КАК CRM_КонтрольнаяТочкаПроекта
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_Мероприятие.Ссылка
		|	ИЗ
		|		Документ.CRM_Мероприятие КАК CRM_Мероприятие
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_ОтчетОРаботе.Ссылка
		|	ИЗ
		|		Документ.CRM_ОтчетОРаботе КАК CRM_ОтчетОРаботе
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_ПланированиеВоронкиПродаж.Ссылка
		|	ИЗ
		|		Документ.CRM_ПланированиеВоронкиПродаж КАК CRM_ПланированиеВоронкиПродаж
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_РассылкаЭлектронныхПисем.Ссылка
		|	ИЗ
		|		Документ.CRM_РассылкаЭлектронныхПисем КАК CRM_РассылкаЭлектронныхПисем
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		удалитьCRM_Сделка.Ссылка
		|	ИЗ
		|		Документ.удалитьCRM_Сделка КАК удалитьCRM_Сделка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		УдалитьCRM_Событие.Ссылка
		|	ИЗ
		|		Документ.УдалитьCRM_Событие КАК УдалитьCRM_Событие
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_УстановкаИспользуемыхПоказателей.Ссылка
		|	ИЗ
		|		Документ.CRM_УстановкаИспользуемыхПоказателей КАК CRM_УстановкаИспользуемыхПоказателей
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_Телемаркетинг.Ссылка
		|	ИЗ
		|		Документ.CRM_Телемаркетинг КАК CRM_Телемаркетинг
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Анкета.Ссылка
		|	ИЗ
		|		Документ.Анкета КАК Анкета
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КоммерческоеПредложениеКлиенту.Ссылка
		|	ИЗ
		|		Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КорректировкаРегистров.Ссылка
		|	ИЗ
		|		Документ.КорректировкаРегистров КАК КорректировкаРегистров
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НазначениеОпросов.Ссылка
		|	ИЗ
		|		Документ.НазначениеОпросов КАК НазначениеОпросов
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СообщениеSMS.Ссылка
		|	ИЗ
		|		Документ.СообщениеSMS КАК СообщениеSMS
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТелефонныйЗвонок.Ссылка
		|	ИЗ
		|		Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЭлектронноеПисьмоВходящее.Ссылка
		|	ИЗ
		|		Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЭлектронноеПисьмоИсходящее.Ссылка
		|	ИЗ
		|		Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗадачаИсполнителя.Ссылка
		|	ИЗ
		|		Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_БизнесПроцесс.Ссылка
		|	ИЗ
		|		БизнесПроцесс.CRM_БизнесПроцесс КАК CRM_БизнесПроцесс
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Задание.Ссылка
		|	ИЗ
		|		БизнесПроцесс.Задание КАК Задание
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		МаркетинговыеМероприятия.Ссылка
		|	ИЗ
		|		Справочник.МаркетинговыеМероприятия КАК МаркетинговыеМероприятия
		|
		// +CRM не переносить в объединенные решения
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		CRM_СчетНаОплатуПокупателю.Ссылка
		|	ИЗ
		|		Документ.CRM_СчетНаОплатуПокупателю КАК CRM_СчетНаОплатуПокупателю
		// -CRM не переносить в объединенные решения
		|) КАК ВложенныйЗапрос";
		
		Выборка = Запрос.Выполнить().Выбрать();
		РазностьДат = КонецМесяца(ТекущаяДатаСеанса()) - НачалоДня(ДатаПоследнегоОбъекта);
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.CRM_УстановкаИспользуемыхПоказателей") Тогда
				Об = Выборка.Ссылка.Скопировать();
			Иначе	
				Об = Выборка.Ссылка.ПолучитьОбъект();
			КонецЕсли;
			Для Каждого Реквизит Из Об.Метаданные().Реквизиты Цикл
				Если ТипЗнч(Об) = Тип("ДокументОбъект.CRM_УстановкаИспользуемыхПоказателей") И Найти(Реквизит.Имя, "ПериодаПланирования") > 0 Тогда
					Продолжить;
				КонецЕсли;	
				Если Реквизит.Тип = ОписаниеДата ИЛИ Реквизит.Тип = ОписаниеДатаВремя Тогда
					Значение = Об[Реквизит.Имя];
					Если Значение = '00010101' Тогда
						Продолжить;
					КонецЕсли;
					Дата = Об[Реквизит.Имя];
					ДатаНов = Дата + РазностьДат;
					//ДатаНов = Дата(2017, 3, День(Дата), Час(Дата), Минута(Дата), Секунда(Дата));
					Об[Реквизит.Имя] = ДатаНов;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого Реквизит Из Об.Метаданные().СтандартныеРеквизиты Цикл
				Если Реквизит.Тип = ОписаниеДата ИЛИ Реквизит.Тип = ОписаниеДатаВремя Тогда
					Значение = Об[Реквизит.Имя];
					Если Значение = '00010101' Тогда
						Продолжить;
					КонецЕсли;
					Дата = Об[Реквизит.Имя];
					ДатаНов = Дата + РазностьДат;
					//ДатаНов = Дата(2017, 3, День(Дата), Час(Дата), Минута(Дата), Секунда(Дата));
					Об[Реквизит.Имя] = ДатаНов;
				КонецЕсли;
			КонецЦикла;
			
			Для Каждого ТабЧасть Из Об.Метаданные().ТабличныеЧасти Цикл
				Для Каждого Реквизит Из ТабЧасть.Реквизиты Цикл
					Если Реквизит.Тип = ОписаниеДата ИЛИ Реквизит.Тип = ОписаниеДатаВремя Тогда
						Для Каждого Строка из Об[ТабЧасть.Имя] Цикл
							Значение = Строка[Реквизит.Имя];
							Если Значение = '00010101' Тогда
								Продолжить;
							КонецЕсли;
							Дата = Строка[Реквизит.Имя];
							ДатаНов = Дата + РазностьДат;
							//ДатаНов = Дата(2017, 3, День(Дата), Час(Дата), Минута(Дата), Секунда(Дата));
							Строка[Реквизит.Имя] = ДатаНов;
						КонецЦикла;
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			Если ТипЗнч(Об) = Тип("ДокументОбъект.CRM_УстановкаИспользуемыхПоказателей") Тогда
				Об.Дата = НачалоМесяца(ТекущаяДатаСеанса());
				Об.НачалоПериодаПланирования = НачалоМесяца(Об.Дата);
				Об.КонецПериодаПланирования = КонецМесяца(Об.Дата);
				Об.ПредставлениеПериодаПланирования = ПредставлениеПериода(Об.НачалоПериодаПланирования, КонецДня(Об.КонецПериодаПланирования), "L = ru_RU");
			КонецЕсли;
			Попытка
				Если Найти(Строка(ТипЗнч(Об)), "Документ объект") = 0 Тогда
					Об.Записать();
				Иначе
					Об.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;	
			Исключение	
				Об.ОбменДанными.Загрузка = Истина;
				Если Найти(Строка(ТипЗнч(Об)), "Документ объект") = 0 Тогда
					Об.Записать(); 
				Иначе
					Об.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;	
			КонецПопытки;
		КонецЦикла;
		
		НаборЗаписей = РегистрыСведений.НапоминанияПользователя.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		Для Каждого тЗапись Из НаборЗаписей Цикл
			Значение = тЗапись.ВремяСобытия;
			Если Значение <> '00010101' Тогда
				тЗапись.ВремяСобытия = тЗапись.ВремяСобытия + РазностьДат;
			КонецЕсли;
			Значение = тЗапись.СрокНапоминания;
			Если Значение <> '00010101' Тогда
				тЗапись.СрокНапоминания = тЗапись.ВремяСобытия + РазностьДат;
			КонецЕсли;
		КонецЦикла;
		ВыборкаВзаимодействий = Документы.CRM_Взаимодействие.Выбрать();
		Пока ВыборкаВзаимодействий.Следующий() Цикл
			Если ВыборкаВзаимодействий.ПометкаУдаления Тогда Продолжить конецЕсли;
			Об = ВыборкаВзаимодействий.ПолучитьОбъект();
			Об.Записать();
		КонецЦикла;	
		Константы.CRM_ДемонстрационныйРежим.Установить(Ложь);
	КонецЕсли;
КонецПроцедуры

// Процедура обрабатывает полученные реквизиты в полученных объектах
Процедура ОбновитьДемоДатыОбъекта(Объект, РеквизитыДаты, Разность)
	
	Для Каждого тРеквизит Из РеквизитыДаты Цикл
		ИмяРеквизита = тРеквизит.Значение;
		Если Найти(ИмяРеквизита, "ТЧ__") > 0 Тогда
			ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "ТЧ__", "");
			ИмяТЧ = Лев(ИмяРеквизита, Найти(ИмяРеквизита, "||") - 1);
			ТЧ = Объект[ИмяТЧ];
			ИмяРеквизита = СтрЗаменить(ИмяРеквизита, ИмяТЧ + "||", "");
			Для Каждого СтрокаТЧ Из ТЧ Цикл
				Значение = СтрокаТЧ[ИмяРеквизита];
				Если Значение = '00010101' Тогда
					Продолжить;
				КонецЕсли;
				СтрокаТЧ[ИмяРеквизита] = Значение + Разность; 
			КонецЦикла;
		Иначе
			Значение = Объект[ИмяРеквизита];
			Если Значение = '00010101' Тогда
				Продолжить;
			КонецЕсли;
			Объект[ИмяРеквизита] = Значение + Разность; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает дату актуальности демонстрационной базы.
// Устанавливается вручную.
Функция ВернутьДатуАктуальностиДемоБазы()
	Возврат '20170201';
КонецФункции
